<?php

namespace Database\Seeders;

use App\Models\FAQ;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FAQSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $faqs = [
            [
                'question' => "كيف أختار الباقة المناسبة؟",
                'answer' => "بناءً على مستواك :
* اختر الباقة المكثفة إذا كنت مبتدئ،، أو متوسط وترغب بخطة شاملة لحد هذه الأهداف الدقيقة )خسارة الدهون، البناء
العضلي، الخروج من الأنظمة القاسية، استعادة الدورة الشهرية(
* اختر الباقة الرياضية إذا كنت متمكنًا غذائيًا ومتمرسًا في حساب السعرات وتحديد الماكروز والسعرات المناسبة لهدفك، ولكن
ترغب أن تتعلم كيف تتمرن بطريقة تخدم أهدافك من خلال تصميم جدول رياضي مخصص لهدفك ومستواك مع إشراف مكثف
من خلال المراجعات.
* اختر باقة التغذية إذا كنت متمكنًا رياضيًا ولكنك لا تعرف طريقة حساب السعرات، أو طريقة تحديد السعرات المناسبة لهدفك، أو
لم تستطع الوصول إلى هدفك بسبب التشتت الغذائي.
* اختر باقة التدريب الجزئي إذا كنت بمستوى متوسط فأعلى، وترغب في إشراف جزئي ) مراجعة كل أسبوعين( لمتابعة
تطورك والتأكد من أن تسير في الطريق المناسب لهدفك مع التعديلات المستمرة على الجدول حسب تغيير مؤشرات جسمك
أسبوعيًا ) ديلود، زيادة/تقليل الحجم التدريبي، تخصيص الأهداف، والخ(",
            ],
            [
                "question" => "متى سأصل إلى هدفي؟",
                "answer" => "تعتمد المدة على مدى واقعية هدفك، مستواك، تاريخك مع الأنظمة الغذائية والرياضية، سلوكياتك وعالقتك مع الطعام والتمرين.
أنا لست ضد الأهداف الشكلية، ولكن أسلوبي في التدريب ليس حصرًا على شكل الجسم فقط، أنا أدرب لنمط حياة مستدام وليس
لبطولة كمال الأجسام، أبذل قصارى جهدي لتصل إلى هدفك بصحة تامة، عالقة صحية مع الأكل والتمرين، عادات وسلوكيات
غذائية مستدامة تضمن لي استمرارك وثباتك بعد الوصول لهدفك دون أن تمضي حياتك في دوامة الدايت",
            ],
            [
                "question" => "هل يشترط التدريب معي اشتراك نادي أو توفير أدوات محددة في المنزل؟",
                "answer" => "لا، أستطيع تدريبك بشنطة أثقال فقط، توفيرك لحبال مقاومة، بنش، ستزيد من قدرتي على إضافة تمارين أكثر تنوعًا لكسر
الروتين، ولكن كبداية يمكن أن تتدرب معي بدمبلز واحد )بعد تطور مستواك سأخبرك أننا بحاجة إلى أوزان أعلى(.",
            ]
        ];

        foreach ($faqs as $faq)
        {
            FAQ::query()->create($faq);
        }

    }
}
