<?php

namespace Database\Seeders;

use App\Models\Opinion;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class OpinionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $opinions = [
            [
                'name' => "اسم العميل",
                "content" => "بعد ما خلصت الأسبوع الثالث من التمارين، ودي أقولك شكررًا! ♥️ كنت مرة أخاف أتمرن بأي وقت غير على الريق، أخاف يجيني ارتجاع، لما قلتي أن
الحمض يرتفع لأن المعدة خالية تجرأت وصرت أسوي بعد الأكل بساعة عادي،",
                ],
            [
                'name' => "اسم العميل",
                "content" => "بعد ما خلصت الأسبوع الثالث من التمارين، ودي أقولك شكررًا! ♥️ كنت مرة أخاف أتمرن بأي وقت غير على الريق، أخاف يجيني ارتجاع، لما قلتي أن
الحمض يرتفع لأن المعدة خالية تجرأت وصرت أسوي بعد الأكل بساعة عادي،",
            ],
            [
                'name' => "اسم العميل",
                "content" => "بعد ما خلصت الأسبوع الثالث من التمارين، ودي أقولك شكررًا! ♥️ كنت مرة أخاف أتمرن بأي وقت غير على الريق، أخاف يجيني ارتجاع، لما قلتي أن
الحمض يرتفع لأن المعدة خالية تجرأت وصرت أسوي بعد الأكل بساعة عادي،",
            ],
            [
                'name' => "اسم العميل",
                "content" => "بعد ما خلصت الأسبوع الثالث من التمارين، ودي أقولك شكررًا! ♥️ كنت مرة أخاف أتمرن بأي وقت غير على الريق، أخاف يجيني ارتجاع، لما قلتي أن
الحمض يرتفع لأن المعدة خالية تجرأت وصرت أسوي بعد الأكل بساعة عادي،",
            ],
        ];

        foreach ($opinions as $opinion) {
            Opinion::query()->create($opinion);
        }
    }
}
