<?php

namespace Database\Seeders;

use App\Models\Package;
use App\Models\Program;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PackageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $packages = [
            [
                "name" => 'باقة التدريب الشامل',
                "description" => "تضم هذه الباقة تدريب رياضي وتغذية مًعا. سيكون هناك ملف مشترك بيني وبينك على قوقل شيت يتضمن تفاصيل خطتك
                     للتدريب ألتمكن من متابعة تطورك بشكل دقيق خالل مراجعاتك األسبوعية التي تتضمن ما يلي/",
                "features" => "-١تسجيل شاشة أو تسجيل صوتي لمناقشة تفاصيل أسبوعك وتقييم ردة فعل جسمك والمؤشرات الحيوية بعد التزامك بالخطة
                  وتحديث الخطة اذا استدعى ذلك
                  -٢متابعة ادائك في التمرين وتطورك في االوزان وتصحيح االخطاء والتأكد من وصولك للشدة المطلوبة من خالل مقاطع الفيديو
                  -٣ متابعة وجباتك والتأكد من صحة حسابك للسعرات وطريقة
                  تركيب وجباتك عند الحاجة
                  -٤تقييم تطورك الجسمي من خالل الوزن و القياسات وصور الجسم
                  -٥مناقشة تطورك على الصعيد النفسي من ناحية عالقتك مع الطعام والتمرين وماهي الصعوبات التي واجهتك / أسبابها / وكيف
                  يمكننا حلها أو الحد منها؟
                  -٦الرد على استفساراتك اليومية خالل ٤٨-٢٤ ساعة في أوقات العمل
                  -٧الحصول على كتاب اساسيات التغذية والتمرين.",
                "price" => 640,
                "period" => "٤ اسابيع",
                "discount_value_when_renew" => 20,
                "member_type" => "عضو مميز"
            ],
            [
                "name" => "باقة التدريب الرياضي",
                'description' => "تضم هذه الباقة تدريب رياضي فقط. سيكون هناك ملف مشترك بيني وبينك على قوقل شيت يتضمن تفاصيل خطتك التدريبية
                    ألتمكن من متابعة تطورك بشكل دقيق خالل مراجعاتك األسبوعية التي تتضمن ما يلي:",
                "features" => "-١تسجيل شاشة أو تسجيل صوتي لمناقشة تفاصيل أسبوعك وتقييم ردة فعل جسمك والمؤشرات الحيوية بعد التزامك بالخطة
                  وتحديثها اذا استدعى ذلك
                  -٢متابعة ادائك في التمرين وتطورك في االوزان وتصحيح االخطاء والتأكد من وصولك للشدة المطلوبة من خالل مقاطع الفيديو
                  -٣مناقشة تطورك على الصعيد النفسي من ناحية عالقتك بالتمرين وماهي الصعوبات التي واجهتك / أسبابها / وكيف يمكننا
                  حلها أو الحد منها؟
                  -٤ الرد على استفساراتك اليومية خالل ٤٨-٢٤ ساعة في أوقات العمل
                   -٥الحصول على كتاب اساسيات التغذية والتمرين",
                "price" => 540,
                "period" => "٤ اسابيع",
                "discount_value_when_renew" => 15,
                "member_type" => "عضو مميز"
            ],
            [
                "name" => "باقة التغذية",
                "description" => "تضم هذه الباقة تعليمات التغذية. سيكون هناك ملف مشترك بيني وبينك على قوقل شيت يتضمن تفاصيل خطتك للتدريب ألتمكن
    من متابعة تطورك بشكل دقيق خلال مراجعاتك الأسبوعية التي تتضمن ما يلي:",
                "features" => "١تسجيل شاشة أو تسجيل صوتي لمناقشة تفاصيل أسبوعك وتقييم ردة فعل جسمك والمؤشرات الحيوية بعد التزامك بالخطة
                  وتحديثها إذا استدعى ذلك
                  -٣ تعليم طريقة استخدام برامج حساب السعرات ومتابعة وجباتك والتأكد من صحة حسابك للسعرات وطريقة
                  تحديد السعرات المناسبة لهدفك وتركيبة جسمك
                  تركيب وجباتك عند الحاجة
                  -٤مناقشة تطورك على الصعيد النفسي من ناحية عالقتك مع الطعام وماهي الصعوبات التي واجهتك / أسبابها / وكيف يمكننا
                  حلها أو الحد منها؟
                  -٥الرد على استفساراتك اليومية خلال ٤٨-٢٤ ساعة في أوقات العمل
                  -٦الحصول على كتاب أساسيات التغذية والتمرين",
                "price" => 440,
                "period" => "٤ أسابيع",
                "discount_value_when_renew" => 15,
                "member_type" => "عضو مميز"
            ]
            ,
            [
                "name" => "باقة التدريب الجزئي",
                "description" => "هذه الباقة مناسبة للشخص المتوسط فأعلى، وأعني 'بالمتوسط' شخص يتمرن أكثر من سنة بخطة علمية وشدة محفزة للبناء
    العضلي وتطبيق الزيادة التدريجية ، تحتوي هذه الباقة على:",
                "features" => "خطة رياضية كاملة، حيث يمكن أن أقوم بتعديل جدولك السابق أو إعادة بناءه إذا تطلب الأمر.
                  ● جدول يتضمن بدائل لكل تمرين حيث يمكنك الدمج بين التمرين المنزلي والنادي حسب ظروفك
                  ● مراجعة كل أسبوعين تتضمن مقاطع فيديو لتمرينك حتى أتمكن من تقييم جودة الجلسة / التكنيك / التأكد من قياس الشدة.
                  ● مراقبة التطور على مدار الخطة من ناحية تقدمك في الوزن والتكرارات.
                  ● مراقبة مؤشرات جسمك لتعديل الحجم التدريبي باستمرار
                  ● تواصل يومي للإجابة على أسئلتك
                  ● الحصول على كتاب أساسيات التغذية والتمرين وصحة المرأة الرياضية",
                "price" => 380,
                "period" => "٤ أسابيع",
                "discount_value_when_renew" => 15,
                "member_type" => "عضو مميز"
            ]
        ];

        foreach ($packages as $program){
            Package::query()->create($program);
        }
    }
}
